000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Улицы/Улицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Улицы</name>
  <attributes>
    <name>ТипУлицы</name>
    <type>
      <types>CatalogRef.ТипыУлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Улицы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти город по имени.
// 
// Параметры:
//  НаименованиеУлицы - Строка - Наименование улицы в виде строки
//  Город - СправочникСсылка.ГородаДоставки - Город, в которм нужно найти улицу
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.Улицы, Строка - Ссылка на город доставки
//  
Функция НайтиУлицу(НаименованиеУлицы, Город, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Улицы.Ссылка
		|ИЗ
		|	Справочник.Улицы КАК Улицы
		|ГДЕ
		|	Улицы.ОператорДоставки = &ОператорДоставки
		|	И (Улицы.Наименование = &НаименованиеУлицы)
		|	И Улицы.Город = &Город";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("НаименованиеУлицы", СокрЛП(НаименованиеУлицы));
	Запрос.УстановитьПараметр("Город", Город);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = НаименованиеУлицы;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
